; domain
(define (domain satellite-typed)
(:requirements :equality :strips :typing)
(:types satellite
        direction
        instrument
        mode)
(:predicates
 (on_board ?i - instrument ?s - satellite)
 (supports ?i - instrument ?m - mode)
 (pointing ?s - satellite ?d - direction)
 (power_avail ?s - satellite)
 (power_on ?i - instrument)
 (calibrated ?i - instrument)
 (have_image ?d - direction ?m - mode)
 (calibration_target ?i - instrument ?d - direction))

(:action turn_to
 :parameters ( ?s - satellite ?d_new ?d_prev - direction)
 :precondition
 (and
      (pointing ?s ?d_prev)
      )
 :effect
 (and (pointing ?s ?d_new)
      (not (pointing ?s ?d_prev))))

(:action switch_on
 :parameters (?i - instrument ?s - satellite)
 :precondition
 (and (on_board ?i ?s)
      (power_avail ?s))
 :effect
 (and (power_on ?i)
      (not (calibrated ?i))
      (not (power_avail ?s))))

(:action switch_off
 :parameters (?i - instrument ?s - satellite)
 :precondition
	(and (on_board ?i ?s)
             (power_on ?i))
 :effect
	(and (power_avail ?s)
             (not (power_on ?i))))

(:action calibrate
 :parameters (?i - instrument ?s - satellite ?d - direction)
 :precondition
	(and (on_board ?i ?s)
             (calibration_target ?i ?d)
             (pointing ?s ?d)
             (power_on ?i))
 :effect
	 (calibrated ?i))

(:action take_image
 :parameters (?i - instrument ?s - satellite ?d - direction ?m - mode)
 :precondition
	(and (calibrated ?i)
             (on_board ?i ?s)
             (supports ?i ?m)
             (power_on ?i)
             (pointing ?s ?d))
 :effect
	 (have_image ?d ?m))

)

; problem
(DEFINE (PROBLEM SATELLITE-TYPED-LOOP-4) (:DOMAIN SATELLITE-TYPED)
 (:OBJECTS DIRECTION-0 DIRECTION-1 DIRECTION-2 DIRECTION-3 - DIRECTION MODE-0
  MODE-1 MODE-2 MODE-3 MODE-4 MODE-5 MODE-6 MODE-7 MODE-8 - MODE
  S0-INSTRUMENT-0 S0-INSTRUMENT-1 S0-INSTRUMENT-2 S1-INSTRUMENT-0
  S1-INSTRUMENT-1 S1-INSTRUMENT-2 S2-INSTRUMENT-0 S2-INSTRUMENT-1
  S2-INSTRUMENT-2 - INSTRUMENT SATELLITE-0 SATELLITE-1 SATELLITE-2 - SATELLITE)
 (:INIT (POINTING SATELLITE-0 DIRECTION-0) (POWER_AVAIL SATELLITE-0)
  (ON_BOARD S0-INSTRUMENT-0 SATELLITE-0)
  (CALIBRATION_TARGET S0-INSTRUMENT-0 DIRECTION-0)
  (ON_BOARD S0-INSTRUMENT-1 SATELLITE-0)
  (CALIBRATION_TARGET S0-INSTRUMENT-1 DIRECTION-0)
  (ON_BOARD S0-INSTRUMENT-2 SATELLITE-0)
  (CALIBRATION_TARGET S0-INSTRUMENT-2 DIRECTION-0)
  (POINTING SATELLITE-1 DIRECTION-0) (POWER_AVAIL SATELLITE-1)
  (ON_BOARD S1-INSTRUMENT-0 SATELLITE-1)
  (CALIBRATION_TARGET S1-INSTRUMENT-0 DIRECTION-0)
  (ON_BOARD S1-INSTRUMENT-1 SATELLITE-1)
  (CALIBRATION_TARGET S1-INSTRUMENT-1 DIRECTION-0)
  (ON_BOARD S1-INSTRUMENT-2 SATELLITE-1)
  (CALIBRATION_TARGET S1-INSTRUMENT-2 DIRECTION-0)
  (POINTING SATELLITE-2 DIRECTION-0) (POWER_AVAIL SATELLITE-2)
  (ON_BOARD S2-INSTRUMENT-0 SATELLITE-2)
  (CALIBRATION_TARGET S2-INSTRUMENT-0 DIRECTION-0)
  (ON_BOARD S2-INSTRUMENT-1 SATELLITE-2)
  (CALIBRATION_TARGET S2-INSTRUMENT-1 DIRECTION-0)
  (ON_BOARD S2-INSTRUMENT-2 SATELLITE-2)
  (CALIBRATION_TARGET S2-INSTRUMENT-2 DIRECTION-0)
  (SUPPORTS S0-INSTRUMENT-0 MODE-0) (SUPPORTS S0-INSTRUMENT-1 MODE-1)
  (SUPPORTS S0-INSTRUMENT-2 MODE-2) (SUPPORTS S1-INSTRUMENT-0 MODE-3)
  (SUPPORTS S1-INSTRUMENT-1 MODE-4) (SUPPORTS S1-INSTRUMENT-2 MODE-5)
  (SUPPORTS S2-INSTRUMENT-0 MODE-6) (SUPPORTS S2-INSTRUMENT-1 MODE-7)
  (SUPPORTS S2-INSTRUMENT-2 MODE-8))
 (:GOAL
  (AND (HAVE_IMAGE DIRECTION-0 MODE-0) (HAVE_IMAGE DIRECTION-0 MODE-1)
       (HAVE_IMAGE DIRECTION-0 MODE-2) (HAVE_IMAGE DIRECTION-0 MODE-3)
       (HAVE_IMAGE DIRECTION-0 MODE-4) (HAVE_IMAGE DIRECTION-0 MODE-5)
       (HAVE_IMAGE DIRECTION-0 MODE-6) (HAVE_IMAGE DIRECTION-0 MODE-7)
       (HAVE_IMAGE DIRECTION-0 MODE-8) (HAVE_IMAGE DIRECTION-1 MODE-0)
       (HAVE_IMAGE DIRECTION-1 MODE-1) (HAVE_IMAGE DIRECTION-1 MODE-2)
       (HAVE_IMAGE DIRECTION-1 MODE-3) (HAVE_IMAGE DIRECTION-1 MODE-4)
       (HAVE_IMAGE DIRECTION-1 MODE-5) (HAVE_IMAGE DIRECTION-1 MODE-6)
       (HAVE_IMAGE DIRECTION-1 MODE-7) (HAVE_IMAGE DIRECTION-1 MODE-8)
       (HAVE_IMAGE DIRECTION-2 MODE-0) (HAVE_IMAGE DIRECTION-2 MODE-1)
       (HAVE_IMAGE DIRECTION-2 MODE-2) (HAVE_IMAGE DIRECTION-2 MODE-3)
       (HAVE_IMAGE DIRECTION-2 MODE-4) (HAVE_IMAGE DIRECTION-2 MODE-5)
       (HAVE_IMAGE DIRECTION-2 MODE-6) (HAVE_IMAGE DIRECTION-2 MODE-7)
       (HAVE_IMAGE DIRECTION-2 MODE-8) (HAVE_IMAGE DIRECTION-3 MODE-0)
       (HAVE_IMAGE DIRECTION-3 MODE-1) (HAVE_IMAGE DIRECTION-3 MODE-2)
       (HAVE_IMAGE DIRECTION-3 MODE-3) (HAVE_IMAGE DIRECTION-3 MODE-4)
       (HAVE_IMAGE DIRECTION-3 MODE-5) (HAVE_IMAGE DIRECTION-3 MODE-6)
       (HAVE_IMAGE DIRECTION-3 MODE-7) (HAVE_IMAGE DIRECTION-3 MODE-8))))

; plan
1. (switch_on s2-instrument-2 satellite-2)
   deleted: (power_avail satellite-2)
   added: (power_on s2-instrument-2)
   goals met: 0 of 36
2. (calibrate s2-instrument-2 satellite-2 direction-0)
   added: (calibrated s2-instrument-2)
   goals met: 0 of 36
3. (take_image s2-instrument-2 satellite-2 direction-0 mode-8)
   added: (have_image direction-0 mode-8)
   goals met: 1 of 36
4. (turn_to satellite-2 direction-3 direction-0)
   deleted: (pointing satellite-2 direction-0)
   added: (pointing satellite-2 direction-3)
   goals met: 1 of 36
5. (take_image s2-instrument-2 satellite-2 direction-3 mode-8)
   added: (have_image direction-3 mode-8)
   goals met: 2 of 36
6. (turn_to satellite-2 direction-2 direction-3)
   deleted: (pointing satellite-2 direction-3)
   added: (pointing satellite-2 direction-2)
   goals met: 2 of 36
7. (take_image s2-instrument-2 satellite-2 direction-2 mode-8)
   added: (have_image direction-2 mode-8)
   goals met: 3 of 36
8. (turn_to satellite-2 direction-1 direction-2)
   deleted: (pointing satellite-2 direction-2)
   added: (pointing satellite-2 direction-1)
   goals met: 3 of 36
9. (take_image s2-instrument-2 satellite-2 direction-1 mode-8)
   added: (have_image direction-1 mode-8)
   goals met: 4 of 36
10. (switch_off s2-instrument-2 satellite-2)
   deleted: (power_on s2-instrument-2)
   added: (power_avail satellite-2)
   goals met: 4 of 36
11. (switch_on s1-instrument-2 satellite-1)
   deleted: (power_avail satellite-1)
   added: (power_on s1-instrument-2)
   goals met: 4 of 36
12. (calibrate s1-instrument-2 satellite-1 direction-0)
   added: (calibrated s1-instrument-2)
   goals met: 4 of 36
13. (take_image s1-instrument-2 satellite-1 direction-0 mode-5)
   added: (have_image direction-0 mode-5)
   goals met: 5 of 36
14. (turn_to satellite-1 direction-3 direction-0)
   deleted: (pointing satellite-1 direction-0)
   added: (pointing satellite-1 direction-3)
   goals met: 5 of 36
15. (take_image s1-instrument-2 satellite-1 direction-3 mode-5)
   added: (have_image direction-3 mode-5)
   goals met: 6 of 36
16. (turn_to satellite-1 direction-2 direction-3)
   deleted: (pointing satellite-1 direction-3)
   added: (pointing satellite-1 direction-2)
   goals met: 6 of 36
17. (take_image s1-instrument-2 satellite-1 direction-2 mode-5)
   added: (have_image direction-2 mode-5)
   goals met: 7 of 36
18. (turn_to satellite-1 direction-1 direction-2)
   deleted: (pointing satellite-1 direction-2)
   added: (pointing satellite-1 direction-1)
   goals met: 7 of 36
19. (take_image s1-instrument-2 satellite-1 direction-1 mode-5)
   added: (have_image direction-1 mode-5)
   goals met: 8 of 36
20. (switch_off s1-instrument-2 satellite-1)
   deleted: (power_on s1-instrument-2)
   added: (power_avail satellite-1)
   goals met: 8 of 36
21. (switch_on s0-instrument-2 satellite-0)
   deleted: (power_avail satellite-0)
   added: (power_on s0-instrument-2)
   goals met: 8 of 36
22. (calibrate s0-instrument-2 satellite-0 direction-0)
   added: (calibrated s0-instrument-2)
   goals met: 8 of 36
23. (take_image s0-instrument-2 satellite-0 direction-0 mode-2)
   added: (have_image direction-0 mode-2)
   goals met: 9 of 36
24. (turn_to satellite-0 direction-3 direction-0)
   deleted: (pointing satellite-0 direction-0)
   added: (pointing satellite-0 direction-3)
   goals met: 9 of 36
25. (take_image s0-instrument-2 satellite-0 direction-3 mode-2)
   added: (have_image direction-3 mode-2)
   goals met: 10 of 36
26. (turn_to satellite-0 direction-2 direction-3)
   deleted: (pointing satellite-0 direction-3)
   added: (pointing satellite-0 direction-2)
   goals met: 10 of 36
27. (take_image s0-instrument-2 satellite-0 direction-2 mode-2)
   added: (have_image direction-2 mode-2)
   goals met: 11 of 36
28. (turn_to satellite-0 direction-1 direction-2)
   deleted: (pointing satellite-0 direction-2)
   added: (pointing satellite-0 direction-1)
   goals met: 11 of 36
29. (take_image s0-instrument-2 satellite-0 direction-1 mode-2)
   added: (have_image direction-1 mode-2)
   goals met: 12 of 36
30. (switch_off s0-instrument-2 satellite-0)
   deleted: (power_on s0-instrument-2)
   added: (power_avail satellite-0)
   goals met: 12 of 36
31. (switch_on s2-instrument-1 satellite-2)
   deleted: (power_avail satellite-2)
   added: (power_on s2-instrument-1)
   goals met: 12 of 36
32. (turn_to satellite-2 direction-0 direction-1)
   deleted: (pointing satellite-2 direction-1)
   added: (pointing satellite-2 direction-0)
   goals met: 12 of 36
33. (calibrate s2-instrument-1 satellite-2 direction-0)
   added: (calibrated s2-instrument-1)
   goals met: 12 of 36
34. (take_image s2-instrument-1 satellite-2 direction-0 mode-7)
   added: (have_image direction-0 mode-7)
   goals met: 13 of 36
35. (turn_to satellite-2 direction-3 direction-0)
   deleted: (pointing satellite-2 direction-0)
   added: (pointing satellite-2 direction-3)
   goals met: 13 of 36
36. (take_image s2-instrument-1 satellite-2 direction-3 mode-7)
   added: (have_image direction-3 mode-7)
   goals met: 14 of 36
37. (turn_to satellite-2 direction-2 direction-3)
   deleted: (pointing satellite-2 direction-3)
   added: (pointing satellite-2 direction-2)
   goals met: 14 of 36
38. (take_image s2-instrument-1 satellite-2 direction-2 mode-7)
   added: (have_image direction-2 mode-7)
   goals met: 15 of 36
39. (turn_to satellite-2 direction-1 direction-2)
   deleted: (pointing satellite-2 direction-2)
   added: (pointing satellite-2 direction-1)
   goals met: 15 of 36
40. (take_image s2-instrument-1 satellite-2 direction-1 mode-7)
   added: (have_image direction-1 mode-7)
   goals met: 16 of 36
41. (switch_off s2-instrument-1 satellite-2)
   deleted: (power_on s2-instrument-1)
   added: (power_avail satellite-2)
   goals met: 16 of 36
42. (switch_on s2-instrument-0 satellite-2)
   deleted: (power_avail satellite-2)
   added: (power_on s2-instrument-0)
   goals met: 16 of 36
43. (turn_to satellite-2 direction-0 direction-1)
   deleted: (pointing satellite-2 direction-1)
   added: (pointing satellite-2 direction-0)
   goals met: 16 of 36
44. (calibrate s2-instrument-0 satellite-2 direction-0)
   added: (calibrated s2-instrument-0)
   goals met: 16 of 36
45. (take_image s2-instrument-0 satellite-2 direction-0 mode-6)
   added: (have_image direction-0 mode-6)
   goals met: 17 of 36
46. (turn_to satellite-2 direction-3 direction-0)
   deleted: (pointing satellite-2 direction-0)
   added: (pointing satellite-2 direction-3)
   goals met: 17 of 36
47. (take_image s2-instrument-0 satellite-2 direction-3 mode-6)
   added: (have_image direction-3 mode-6)
   goals met: 18 of 36
48. (turn_to satellite-2 direction-2 direction-3)
   deleted: (pointing satellite-2 direction-3)
   added: (pointing satellite-2 direction-2)
   goals met: 18 of 36
49. (take_image s2-instrument-0 satellite-2 direction-2 mode-6)
   added: (have_image direction-2 mode-6)
   goals met: 19 of 36
50. (turn_to satellite-2 direction-1 direction-2)
   deleted: (pointing satellite-2 direction-2)
   added: (pointing satellite-2 direction-1)
   goals met: 19 of 36
51. (take_image s2-instrument-0 satellite-2 direction-1 mode-6)
   added: (have_image direction-1 mode-6)
   goals met: 20 of 36
52. (switch_on s1-instrument-1 satellite-1)
   deleted: (power_avail satellite-1)
   added: (power_on s1-instrument-1)
   goals met: 20 of 36
53. (turn_to satellite-1 direction-0 direction-1)
   deleted: (pointing satellite-1 direction-1)
   added: (pointing satellite-1 direction-0)
   goals met: 20 of 36
54. (calibrate s1-instrument-1 satellite-1 direction-0)
   added: (calibrated s1-instrument-1)
   goals met: 20 of 36
55. (take_image s1-instrument-1 satellite-1 direction-0 mode-4)
   added: (have_image direction-0 mode-4)
   goals met: 21 of 36
56. (turn_to satellite-1 direction-3 direction-0)
   deleted: (pointing satellite-1 direction-0)
   added: (pointing satellite-1 direction-3)
   goals met: 21 of 36
57. (take_image s1-instrument-1 satellite-1 direction-3 mode-4)
   added: (have_image direction-3 mode-4)
   goals met: 22 of 36
58. (turn_to satellite-1 direction-2 direction-3)
   deleted: (pointing satellite-1 direction-3)
   added: (pointing satellite-1 direction-2)
   goals met: 22 of 36
59. (take_image s1-instrument-1 satellite-1 direction-2 mode-4)
   added: (have_image direction-2 mode-4)
   goals met: 23 of 36
60. (turn_to satellite-1 direction-1 direction-2)
   deleted: (pointing satellite-1 direction-2)
   added: (pointing satellite-1 direction-1)
   goals met: 23 of 36
61. (take_image s1-instrument-1 satellite-1 direction-1 mode-4)
   added: (have_image direction-1 mode-4)
   goals met: 24 of 36
62. (switch_off s1-instrument-1 satellite-1)
   deleted: (power_on s1-instrument-1)
   added: (power_avail satellite-1)
   goals met: 24 of 36
63. (switch_on s1-instrument-0 satellite-1)
   deleted: (power_avail satellite-1)
   added: (power_on s1-instrument-0)
   goals met: 24 of 36
64. (turn_to satellite-1 direction-0 direction-1)
   deleted: (pointing satellite-1 direction-1)
   added: (pointing satellite-1 direction-0)
   goals met: 24 of 36
65. (calibrate s1-instrument-0 satellite-1 direction-0)
   added: (calibrated s1-instrument-0)
   goals met: 24 of 36
66. (take_image s1-instrument-0 satellite-1 direction-0 mode-3)
   added: (have_image direction-0 mode-3)
   goals met: 25 of 36
67. (turn_to satellite-1 direction-3 direction-0)
   deleted: (pointing satellite-1 direction-0)
   added: (pointing satellite-1 direction-3)
   goals met: 25 of 36
68. (take_image s1-instrument-0 satellite-1 direction-3 mode-3)
   added: (have_image direction-3 mode-3)
   goals met: 26 of 36
69. (turn_to satellite-1 direction-2 direction-3)
   deleted: (pointing satellite-1 direction-3)
   added: (pointing satellite-1 direction-2)
   goals met: 26 of 36
70. (take_image s1-instrument-0 satellite-1 direction-2 mode-3)
   added: (have_image direction-2 mode-3)
   goals met: 27 of 36
71. (turn_to satellite-1 direction-1 direction-2)
   deleted: (pointing satellite-1 direction-2)
   added: (pointing satellite-1 direction-1)
   goals met: 27 of 36
72. (take_image s1-instrument-0 satellite-1 direction-1 mode-3)
   added: (have_image direction-1 mode-3)
   goals met: 28 of 36
73. (switch_on s0-instrument-1 satellite-0)
   deleted: (power_avail satellite-0)
   added: (power_on s0-instrument-1)
   goals met: 28 of 36
74. (turn_to satellite-0 direction-0 direction-1)
   deleted: (pointing satellite-0 direction-1)
   added: (pointing satellite-0 direction-0)
   goals met: 28 of 36
75. (calibrate s0-instrument-1 satellite-0 direction-0)
   added: (calibrated s0-instrument-1)
   goals met: 28 of 36
76. (take_image s0-instrument-1 satellite-0 direction-0 mode-1)
   added: (have_image direction-0 mode-1)
   goals met: 29 of 36
77. (turn_to satellite-0 direction-3 direction-0)
   deleted: (pointing satellite-0 direction-0)
   added: (pointing satellite-0 direction-3)
   goals met: 29 of 36
78. (take_image s0-instrument-1 satellite-0 direction-3 mode-1)
   added: (have_image direction-3 mode-1)
   goals met: 30 of 36
79. (turn_to satellite-0 direction-2 direction-3)
   deleted: (pointing satellite-0 direction-3)
   added: (pointing satellite-0 direction-2)
   goals met: 30 of 36
80. (take_image s0-instrument-1 satellite-0 direction-2 mode-1)
   added: (have_image direction-2 mode-1)
   goals met: 31 of 36
81. (turn_to satellite-0 direction-1 direction-2)
   deleted: (pointing satellite-0 direction-2)
   added: (pointing satellite-0 direction-1)
   goals met: 31 of 36
82. (take_image s0-instrument-1 satellite-0 direction-1 mode-1)
   added: (have_image direction-1 mode-1)
   goals met: 32 of 36
83. (switch_off s0-instrument-1 satellite-0)
   deleted: (power_on s0-instrument-1)
   added: (power_avail satellite-0)
   goals met: 32 of 36
84. (switch_on s0-instrument-0 satellite-0)
   deleted: (power_avail satellite-0)
   added: (power_on s0-instrument-0)
   goals met: 32 of 36
85. (turn_to satellite-0 direction-0 direction-1)
   deleted: (pointing satellite-0 direction-1)
   added: (pointing satellite-0 direction-0)
   goals met: 32 of 36
86. (calibrate s0-instrument-0 satellite-0 direction-0)
   added: (calibrated s0-instrument-0)
   goals met: 32 of 36
87. (take_image s0-instrument-0 satellite-0 direction-0 mode-0)
   added: (have_image direction-0 mode-0)
   goals met: 33 of 36
88. (turn_to satellite-0 direction-3 direction-0)
   deleted: (pointing satellite-0 direction-0)
   added: (pointing satellite-0 direction-3)
   goals met: 33 of 36
89. (take_image s0-instrument-0 satellite-0 direction-3 mode-0)
   added: (have_image direction-3 mode-0)
   goals met: 34 of 36
90. (turn_to satellite-0 direction-2 direction-3)
   deleted: (pointing satellite-0 direction-3)
   added: (pointing satellite-0 direction-2)
   goals met: 34 of 36
91. (take_image s0-instrument-0 satellite-0 direction-2 mode-0)
   added: (have_image direction-2 mode-0)
   goals met: 35 of 36
92. (turn_to satellite-0 direction-1 direction-2)
   deleted: (pointing satellite-0 direction-2)
   added: (pointing satellite-0 direction-1)
   goals met: 35 of 36
93. (take_image s0-instrument-0 satellite-0 direction-1 mode-0)
   added: (have_image direction-1 mode-0)
   goals met: 36 of 36
